Table of Contents
 Class InformationMessage
Namespace
IdeaRS.OpenModel.Message
Assembly
IdeaRS.OpenModel.dll
Open Information message
[Obfuscation(Feature = "renaming")]
[DataContract]
public class InformationMessage : OpenMessage
Inheritance
object
OpenObject
OpenMessage
InformationMessage
Inherited Members
 OpenMessage.Create(MessageNumber, OpenObject, string, string, OpenMessage)
 OpenMessage.Number
 OpenMessage.InnerMessage
 OpenMessage.Description
 OpenMessage.Object
 OpenMessage.PropertyName
 OpenMessage.PropertyValue
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 InformationMessage()
Constructor
public InformationMessage()
Properties
 Message
Gets the Message
public override string Message { get; }
Property Value
string
 Edit this page